IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/C2000/f2838x_cm_cm_memcfg_regs.xml
<module id="CM_MEMCFG_REGS" HW_revision="" description="CM MEMCFG Registers">
	<register id="CxLOCK" width="32" page="1" offset="0x0" internal="0" description="C RAM Config Lock Register">
		<bitfield id="LOCK_C0" description="C0 RAM Lock bits" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="LOCK_C1" description="C1 RAM Lock bits" begin="1" end="1" width="1" rwaccess="RW"/>
	</register>
	<register id="CxTEST" width="32" page="1" offset="0x4" internal="0" description="C RAM TEST Register">
		<bitfield id="TEST_C0" description="Selects the different modes for C0 RAM" begin="1" end="0" width="2" rwaccess="RW"/>
		<bitfield id="TEST_C1" description="Selects the different modes for C1 RAM" begin="3" end="2" width="2" rwaccess="RW"/>
	</register>
	<register id="CxINIT" width="32" page="1" offset="0x8" internal="0" description="C RAM Init Register">
		<bitfield id="INIT_C0" description="RAM Initialization control for C0 RAM." begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="INIT_C1" description="RAM Initialization control for C1 RAM." begin="1" end="1" width="1" rwaccess="RW"/>
	</register>
	<register id="CxINITDONE" width="32" page="1" offset="0xc" internal="0" description="C RAM Initialization Status Register">
		<bitfield id="INITDONE_C0" description="RAM Initialization status for C0 RAM." begin="0" end="0" width="1" rwaccess="R"/>
		<bitfield id="INITDONE_C1" description="RAM Initialization status for C1 RAM." begin="1" end="1" width="1" rwaccess="R"/>
	</register>
	<register id="CMMSGxLOCK" width="32" page="1" offset="0x20" internal="0" description="CM Messae RAM Config Lock Register">
		<bitfield id="LOCK_CMTOCPU1MSGRAM0" description="Message RAM CMTOCPU1MSGRAM0 Lock bits" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="LOCK_CMTOCPU1MSGRAM1" description="Message RAM CMTOCPU1MSGRAM1 Lock bits" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="LOCK_CMTOCPU2MSGRAM0" description="Message RAM CMTOCPU2MSGRAM0 Lock bits" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="LOCK_CMTOCPU2MSGRAM1" description="Message RAM CMTOCPU2MSGRAM1 Lock bits" begin="3" end="3" width="1" rwaccess="RW"/>
	</register>
	<register id="CMMSGxTEST" width="32" page="1" offset="0x24" internal="0" description="CM Messae  RAM TEST Register">
		<bitfield id="TEST_CMTOCPU1MSGRAM0" description="Selects the different modes for Message RAM CMTOCPU1MSGRAM0" begin="1" end="0" width="2" rwaccess="RW"/>
		<bitfield id="TEST_CMTOCPU1MSGRAM1" description="Selects the different modes for Message RAM CMTOCPU1MSGRAM1" begin="3" end="2" width="2" rwaccess="RW"/>
		<bitfield id="TEST_CMTOCPU2MSGRAM0" description="Selects the different modes for Message RAM CMTOCPU2MSGRAM0" begin="5" end="4" width="2" rwaccess="RW"/>
		<bitfield id="TEST_CMTOCPU2MSGRAM1" description="Selects the different modes for Message RAM CMTOCPU2MSGRAM1" begin="7" end="6" width="2" rwaccess="RW"/>
	</register>
	<register id="CMMSGxINIT" width="32" page="1" offset="0x28" internal="0" description="CM Messae  RAM Init Register">
		<bitfield id="INIT_CMTOCPU1MSGRAM0" description="RAM Initialization control for Message RAM CMTOCPU1MSGRAM0 " begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="INIT_CMTOCPU1MSGRAM1" description="RAM Initialization control for Message RAM CMTOCPU1MSGRAM1" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="INIT_CMTOCPU2MSGRAM0" description="RAM Initialization control for Message RAM CMTOCPU2MSGRAM0 " begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="INIT_CMTOCPU2MSGRAM1" description="RAM Initialization control for Message RAM CMTOCPU2MSGRAM1" begin="3" end="3" width="1" rwaccess="RW"/>
	</register>
	<register id="CMMSGxINITDONE" width="32" page="1" offset="0x2c" internal="0" description="CM Messae  RAM Initialization Status Register">
		<bitfield id="INITDONE_CMTOCPU1MSGRAM0" description="RAM Initialization status for Message RAM CMTOCPU1MSGRAM0 " begin="0" end="0" width="1" rwaccess="R"/>
		<bitfield id="INITDONE_CMTOCPU1MSGRAM1" description="RAM Initialization status for Message RAM CMTOCPU1MSGRAM1" begin="1" end="1" width="1" rwaccess="R"/>
		<bitfield id="INITDONE_CMTOCPU2MSGRAM0" description="RAM Initialization status for Message RAM CMTOCPU2MSGRAM0" begin="2" end="2" width="1" rwaccess="R"/>
		<bitfield id="INITDONE_CMTOCPU2MSGRAM1" description="RAM Initialization status for Message RAM CMTOCPU2MSGRAM1" begin="3" end="3" width="1" rwaccess="R"/>
	</register>
	<register id="SxGROUP1_LOCK" width="32" page="1" offset="0x40" internal="0" description="Group1 S and E RAM Config Lock Register">
		<bitfield id="LOCK_S0" description="S0 RAM Lock bits" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="LOCK_S1" description="S1 RAM Lock bits" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="LOCK_S2" description="S2 RAM Lock bits" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="LOCK_S3" description="S3 RAM Lock bits" begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="LOCK_E0" description="E0 RAM Lock bits" begin="4" end="4" width="1" rwaccess="RW"/>
	</register>
	<register id="SxGROUP1_TEST" width="32" page="1" offset="0x44" internal="0" description="Group1 S and E  RAM TEST Register">
		<bitfield id="TEST_S0" description="Selects the different modes for S0 RAM" begin="1" end="0" width="2" rwaccess="RW"/>
		<bitfield id="TEST_S1" description="Selects the different modes for S1 RAM" begin="3" end="2" width="2" rwaccess="RW"/>
		<bitfield id="TEST_S2" description="Selects the different modes for S2 RAM" begin="5" end="4" width="2" rwaccess="RW"/>
		<bitfield id="TEST_S3" description="Selects the different modes for S3 RAM" begin="7" end="6" width="2" rwaccess="RW"/>
		<bitfield id="TEST_E0" description="Selects the different modes for E0 RAM" begin="9" end="8" width="2" rwaccess="RW"/>
	</register>
	<register id="SxGROUP1_INIT" width="32" page="1" offset="0x48" internal="0" description="Group1 S and E  RAM Init Register">
		<bitfield id="INIT_S0" description="RAM Initialization control for S0 RAM." begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="INIT_S1" description="RAM Initialization control for S1 RAM." begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="INIT_S2" description="RAM Initialization control for S2 RAM." begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="INIT_S3" description="RAM Initialization control for S3 RAM." begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="INIT_E0" description="RAM Initialization control for E0 RAM." begin="4" end="4" width="1" rwaccess="RW"/>
	</register>
	<register id="SxGROUP1_INITDONE" width="32" page="1" offset="0x4c" internal="0" description="Group1 S and E  RAM Initialization Status Register">
		<bitfield id="INITDONE_S0" description="RAM Initialization status for S0 RAM." begin="0" end="0" width="1" rwaccess="R"/>
		<bitfield id="INITDONE_S1" description="RAM Initialization status for S1 RAM." begin="1" end="1" width="1" rwaccess="R"/>
		<bitfield id="INITDONE_S2" description="RAM Initialization status for S2 RAM." begin="2" end="2" width="1" rwaccess="R"/>
		<bitfield id="INITDONE_S3" description="RAM Initialization status for S3 RAM." begin="3" end="3" width="1" rwaccess="R"/>
		<bitfield id="INITDONE_E0" description="RAM Initialization status for E0 RAM." begin="4" end="4" width="1" rwaccess="R"/>
	</register>
	<register id="ROM_LOCK" width="32" page="1" offset="0x80" internal="0" description="ROM Config Lock Register">
		<bitfield id="LOCK_BOOTROM" description="BOOTROM Lock bits" begin="0" end="0" width="1" rwaccess="RW"/>
	</register>
	<register id="ROM_TEST" width="32" page="1" offset="0x84" internal="0" description="ROM  TEST Register">
		<bitfield id="TEST_BOOTROM" description="Selects the different modes for BOOTROM" begin="1" end="0" width="2" rwaccess="RW"/>
	</register>
	<register id="ROM_FORCE_ERROR" width="32" page="1" offset="0x88" internal="0" description="ROM Force Error register">
		<bitfield id="FORCE_BOOTROM_ERROR" description="Force Bootrom Parity Error" begin="0" end="0" width="1" rwaccess="RW"/>
	</register>
	<register id="PERI_MEM_TEST_LOCK" width="32" page="1" offset="0xa0" internal="0" description="Peripheral Memory Test Lock Register">
		<bitfield id="LOCK_PERI_MEM_TEST_CONTROL" description="PERI_MEM_TEST_CONTROL Lock bit" begin="0" end="0" width="1" rwaccess="RW"/>
	</register>
	<register id="PERI_MEM_TEST_CONTROL" width="32" page="1" offset="0xa4" internal="0" description="Peripheral Memory Test control Register">
		<bitfield id="EMAC_TEST_ENABLE" description="EMAC Test mode enable" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="EMAC_MEM_FORCE_ERROR" description="Force Parity Error on EMAC RAM" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="EtherCAT_TEST_ENABLE" description="EtherCAT Test mode enable" begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="EtherCAT_MEM_FORCE_ERROR" description="Force Parity Error on EtherCAT RAM" begin="5" end="5" width="1" rwaccess="RW"/>
	</register>
</module>
